Repository: hm21/alex-frei-cv
Catalog: src/locale/messages.*.xlf
Languages: de, vi

source: Employees!
de: Angestellten!

source: Industry!
de: Branche!

source: Construction!
de: Baustelle!

source: Control!
de: Kontrolle!

source: The application snaptab was primarily developed for craftsmen and offers a wide range of features. From time tracking to scheduling appointments, tasks, project workflows, and even creating invoices and quotes, everything is provided. All of this is enhanced with artificial intelligence and the ability to collect payments directly from customers using Stripe. Through the customer portal, customers can directly access data shared by the company. <br><br> The application is offered as a web app as well as a mobile app for Android and iOS.
de: Die Anwendung snaptab wurde in erster Linie für Handwerker entwickelt und bietet eine breite Palette von Funktionen. Von der Zeiterfassung über die Planung von Terminen, Aufgaben und Projektabläufen bis hin zur Erstellung von Rechnungen und Angeboten ist alles dabei. Ergänzt wird das Ganze durch künstliche Intelligenz und die Möglichkeit, Zahlungen direkt von Kunden über Stripe einzuziehen. Über das Kundenportal können die Kunden direkt auf die vom Unternehmen freigegebenen Daten zugreifen. Die Anwendung wird sowohl als Web-App als auch als mobile App für Android und iOS angeboten.

source: Project
de: Projekte

source: Employee
de: Mitarbeiter

source: Docs
de: Dokumente

source: Events
de: Termine

source: Time
de: Zeit

source: Client portal
de: Kundenportal

source: AI
de: KI

source: More
de: Mehr

source: Other Projects
de: Sonstige Projekte

source: Presentation website from the company waio Applications.
de: Präsentationswebseite der Firma waio Applications.

source: This website introduces WAIO Applications, my own company. Alongside information about my company, it offers two captivating games to enrich the user experience.<br> You can find one of these games by clicking on the "Team" tab and then pressing the "Icebreaker" button. The other game is hidden as an "easter egg" on the homepage. Simply scroll to the "For all devices" section, click on the red rectangle (which represents a phone with a scale animation).<br><br> On the subdomain image.waio.ch, we provide a straightforward tool for resizing and converting images to various formats and sizes.<br><br> The website was designed with a focus on performance and accessibility, and it is fully responsive, ensuring a seamless experience across all devices.<br><br> Most of the UI/UX part of this project is not mine.
de: Diese Webseite stellt WAIO Applications, mein eigenes Unternehmen, vor. Neben Informationen über mein Unternehmen bietet sie zwei fesselnde Spiele, um das Benutzererlebnis zu bereichern. Eines dieser Spiele finden Sie, indem Sie auf den Tab „Team“ klicken und dann auf die Schaltfläche „Icebreaker“ drücken. Das andere Spiel ist als „Easter Egg“ auf der Homepage versteckt. Scrollen Sie einfach zum Abschnitt „Für alle Geräte“, klicken Sie auf das rote Rechteck (das ein Telefon mit einer Skalierungsanimation darstellt). <br><br> Auf der Subdomain image.waio.ch bieten wir ein unkompliziertes Tool zum Ändern der Größe und Konvertieren von Bildern in verschiedene Formate und Größen an. <br><br> Die Webseite wurde mit Schwerpunkt auf Leistung und Zugänglichkeit entworfen und ist vollständig responsiv, um ein nahtloses Erlebnis auf allen Geräten zu gewährleisten. <br><br> Der Großteil des UI/UX-Teils dieses Projekts stammt nicht von mir.

source: A Flutter widget designed for image editing on any device.
de: Ein Flutter-Widget für die Bildbearbeitung auf jedem Gerät.

source: The ProImageEditor is a Flutter widget designed for image editing. It provides a flexible and convenient way to integrate image editing capabilities into Flutter projects. The editor has a great hit detection ensuring that drawing actions are triggered only when the user actively hovers over the drawing area. Furthermore, the editor is highly customizable, allowing for complete adaptation to specific project requirements, and it offers effortless translation capabilities, simplifying the localization process.
de: Der ProImageEditor ist ein Flutter-Widget für die Bildbearbeitung. Er bietet eine flexible und bequeme Möglichkeit, Bildbearbeitungsfunktionen in Flutter-Projekte zu integrieren. Der Editor verfügt über großartige „Hit-Boxen“, die sicherstellen, dass Berührungen von Zeichnungen nur dann ausgelöst werden, wenn der Benutzer aktiv über den Zeichnungsbereich mit der Maus fährt. Ebenso ist der Editor in hohem Maße anpassbar, was eine vollständige Anpassung an spezifische Projektanforderungen ermöglicht, und er bietet mühelose Übersetzungsfunktionen, die den Lokalisierungsprozess vereinfachen.

source: Editor showcase
de: Editor Vorschau

source: Painting editor
de: Zeichnungs-Editor

source: Crop rotate
de: Zuschneidungs-Editor

source: Add automatic scroll animations to an angular 9+ app.
de: Automatische scroll-animationen für Angular 9+ apps.

source: A package for implementing CSS scroll animations on elements. These animations activate when an element enters the viewport during page scrolling. Users have the flexibility to configure the animations to trigger multiple times or just once. Additionally, the package offers pre-made animations as well as the option to create custom ones to suit various requirements.
de: Ein Paket zur Implementierung von CSS-Scroll-Animationen für Elemente. Diese Animationen werden aktiviert, wenn ein Element beim Scrollen der Seite in den „Sichtbereich“ eintritt. Die Benutzer haben die Flexibilität, die Animationen so zu konfigurieren, dass sie mehrmals oder nur einmal ausgelöst werden. Außerdem ermöglicht das Paket vorgefertigte sowie benutzerdefinierte Animationen für verschiedene Anforderungen zu erstellen.

source: Scroll animations showcase
de: Vorschau „scroll-animations“

source: Easy way that images will fly to the middle of the screen for presentation.
de: Einfache Möglichkeit, dass Bilder zur Präsentation in die Mitte des Bildschirms fliegen.

source: A package to implement hero animations, allowing users to click on images and smoothly zoom them into a larger, immersive view, enhancing the user experience and interaction with images.<br><br> Please note that the preview below may not appear as smooth as it does in reality. This is because I reduced the frame rate of the GIF to conserve storage space.
de: Ein Paket zur Implementierung von Hero-Animationen, die es Benutzern ermöglichen, auf Bilder zu klicken, damit sie flüssig vergrößert werden, was die Benutzererfahrung und die Interaktion mit Bildern verbessert.<br><br> Bitte beachten Sie, dass die Vorschau unten möglicherweise nicht so sanft erscheint wie in der Realität. Das liegt daran, dass ich die Bildrate des GIFs reduziert habe, um Speicherplatz zu sparen.

source: Image hero showcase
de: Image hero Vorschau

source: Count numbers up and down with smooth animation.
de: Zählt Zahlen flüssig hoch und runter.

source: A package that elegantly animates number changes, creating a visually engaging transition from one value to another, perfect for counting or displaying real-time data updates.<br><br> Please note that the preview below may not appear as smooth as it does in reality. This is because I reduced the frame rate of the GIF to conserve storage space.
de: Ein Paket, das Zahlenänderungen elegant animiert und einen visuell ansprechenden Übergang von einem Wert zum anderen schafft, perfekt zum Zählen oder zur Anzeige von Datenaktualisierungen in Echtzeit.<br><br> Bitte beachten Sie, dass die Vorschau unten möglicherweise nicht so flüssig erscheint wie in Wirklichkeit. Das liegt daran, dass ich die Bildrate des GIFs reduziert habe, um Speicherplatz zu sparen.

source: Count animation showcase
de: Count animation Vorschau

source: Smarthome app to automate bee hives and gardens.
de: Smarthome-App zur Automatisierung von Bienenstöcken und Gärten.

source: This project is a real-time control application. Users can directly program the functions of GPIO ports without requiring any programming knowledge. Additionally, users can access data about the personal beehive, including real-time temperature readings and the amount of honey produced by the bees.
de: Dieses Projekt ist eine Echtzeit-Steuerungsanwendung. Die Benutzer können die Funktionen der GPIO-Ports direkt programmieren, ohne dass Programmierkenntnisse erforderlich sind. Außerdem können die Benutzer auf Daten über den persönlichen Bienenstock zugreifen, einschließlich Echtzeit-Temperaturmessungen sowie die von den Bienen produzierte Honigmenge.

source: Smarthome bee overview
de: Smarthome Bienen-Übersicht

source: Smarthome bee details
de: Smarthome Bienen-Details

source: Smarthome switch
de: Smarthome Schalter

source: Color Clash Game
de: Color Clash Spiel

source: Congratulations, you scored {{ points }} points and {{ mistakes }} mistakes! <br /><br /><span [innerHTML]="msg()"></span>@if (highScoreMsg()) {<br /><br /> {{ highScoreMsg() }} }
de: Herzlichen Glückwunsch, Sie haben {{ points }} Punkte und {{ mistakes }} Fehler! <br /><br /><span [innerHTML]="msg()"></span>@if (highScoreMsg()) {<br /><br /> {{ highScoreMsg() }} }

source: &nbspThe goal is to score more than 120 points without any mistakes!
de: &nbspDas Ziel ist es, fehlerfrei mehr als 120 Punkte zu erzielen!

source: &nbspBut wait a minute, you got more than 120 points?!! That's awesome, seems like you're a genius!
de: &nbspAber Moment, Sie haben mehr als 120 Punkte?!! Das ist großartig, anscheinend sind Sie ein Genie!

source: Next
de: Weiter

source: I'm sorry, but the correct answer was <b>{{ correctAnswerLetter() }}</b >.
de: Es tut mir leid, aber die richtige Antwort war <b>{{ correctAnswerLetter() }}</b >.

source: One moment please <br /><br /> The quiz will be generated. This usually takes less than 20 seconds.
de: Einen Moment bitte <br /><br /> Das Quiz wird generiert. Dies dauert normalerweise weniger als 20 Sekunden.

source: Oops you loose!
de: Hoppla, Sie haben verloren!

source: It seems like you still have more to learn about this topic before you can master it. Try a new topic, and let's see if you can win more than {{ +wonCash | number: "1.2-2" }} CHF there.
de: Es scheint, als müssten Sie noch mehr über dieses Thema lernen, bevor Sie es meistern können. Probieren Sie ein neues Thema aus und versuchen Sie mehr als {{ +wonCash | number: "1.2-2" }} CHF dort zu gewinnen.

source: Quantum Quiz Game
de: Quantum Quiz Spiel

source: Let's play a <span class="color-primary">mini-game</span> to relax a bit!
de: Spielen Sie ein <span class="color-primary">Minispiel</span> um einwenig zu entspannen!

source: Can you emerge victorious on the millionaire show with your AI-generated topic?
de: Können Sie mit einem von Ihnen ausgewählten KI-generierten Thema in der Millionärsshow als Sieger hervorgehen?

source: Attempt to keep your mind under control without getting confused.
de: Versuchen Sie, Ihren Verstand unter Kontrolle zu halten, ohne verwirrt zu werden.

source: More knowledges
de: Weiteres Wissen

source: Elementary school education
de: Grundschulausbildung

source: Apprenticeship for Certified Electrical-Installer EFZ
de: Ausbildung als Elektroinstallateur EFZ

source: Worked by Brunner & Engler as Electrical-Installer
de: Bei Brunner & Engler als Elektroinstallateur gearbeitet

source: Military training
de: Militärausbildung

source: Basic training and training to become a “Wachtmeister”.
de: Grundausbildung sowie Weiterbildung zum „Wachtmeister“.

source: Worked by Elektro Sutter as Electrical-Installer
de: Bei Elektro Sutter als Elektroinstallateur gearbeitet

source: Service technician and project manager. After 2018 change to work only 80% that I have more time for programming.
de: Servicetechniker und Projektleiter. Nach 2018 arbeitete ich nur noch 80 %, sodass ich mehr Zeit zum Programmieren hatte.

source: Learned programming with Java
de: Java Programmiersprache erlernt

source: Program a simple report app with libGDX for use at the current workplace.
de: Programmierte mit libGDX eine simple Rapport-App für den Einsatz am aktuellen Arbeitsplatz.

source: Changed “Report-App” from libGDX to Ionic
de: „Report-App“ von libGDX zu Ionic geändert

source: To make the app more professional and simplify the programming of the app, I changed to Ionic 4.
de: Um die App professioneller zu gestalten und die Programmierung der App zu vereinfachen, bin ich auf Ionic 4 umgestiegen.

source: Foundation of WAIO Applications
de: Gründung von WAIO Applications

source: Programing many different things such as website for company and managing tool. Creation of a web app for “Schule Rotflue” which make it easy for them to present the pedagogical concept.
de: Programmierte viele verschiedene Dinge, wie etwa eine Webseite fürs eigene Unternehmen mit einem Verwaltungstool. Erstellung einer Web-App für die Schule Rotflue, die eine einfache Darstellung des pädagogischen Konzepts ermöglicht.

source: October 24, 2022
de: 24. Oktober 2022

source: Married
de: Heirat

source: Married with my wife in Vietnam.
de: Heirat mit meiner Frau in Vietnam.

source: Start converting the old “Report-App” into a professional product based on Angular and Flutter that can be sold.
de: Beginn mit der Umwandlung der alten „Rapport-App“ in ein professionelles Produkt auf Basis von Angular und Flutter, welches verkauft werden kann.

source: Your IP address has been blacklisted because you have sent an unusually high number of requests to the server! If these requests were not made maliciously, please contact me via
de: Ihre IP-Adresse wurde auf die schwarze Liste gesetzt, weil Sie ungewöhnlich viele Anfragen an den Server gesendet haben! Wenn diese Anfragen nicht in böser Absicht gestellt wurden, kontaktieren Sie mich bitte über

source: Too many requests! Please try again later.
de: Zu viele Anfragen! Bitte versuchen Sie es später noch einmal.

source: Focusing on UI/UX design, I craft intuitive user interfaces for optimal user experience. Creative, technically adept, and user-centric, I enhance interaction and design for maximum efficiency.
de: Als UI/UX-Designer gestalte ich intuitive Benutzeroberflächen für optimale Nutzererfahrung. Kreativ, technisch versiert und nutzerzentriert, strebe ich nach ästhetischen, funktionalen Designs, die Benutzerbedürfnisse erfüllen und die Interaktion verbessern.

source: The Allrounder-Tool for your Company!
de: Das Allrounder-Tool für Ihre Firma!

source: Program an “Endless Runner” game with libGDX.
de: Programmieren Sie ein „Endless Runner“ Spiel mit libGDX.

source: Project “Report-App”
de: Projekt „Rapport-App“

source: Further training in Eschlikon at “bingesser huber elektro ag” on fiber optic splices as well as outdoor and indoor installation.
de: Weiterbildung in Eschlikon bei „bingesser huber elektro ag“ zum Thema Glasfaserinstallationen in Außen- und Innenbereichen.
