Repository: hm21/alex-frei-cv
Catalog: src/locale/messages.*.xlf
Languages: de, vi

source: Download the CV as a PDF
vi: Tải CV dưới dạng PDF

source: Download Successful
vi: Tải xuống thành công

source: Download Failed
vi: Tải xuống không thành công

source: View Location on Google Maps
vi: Xem vị trí trên Google Maps

source: View npm Profile
vi: Xem hồ sơ npm

source: View Stack-Overflow Profile
vi: Xem hồ sơ Stack-Overflow

source: Welcome to the Dark Side
vi: Chào mừng đến với phe Bóng Tối

source: Please wait...
vi: Vui lòng đợi...

source: Show certificate
vi: Hiển thị chứng chỉ

source: Electrical-Installer certificate
vi: Chứng chỉ Lắp ráp Điện

source: Certificate of apprenticeship for Certified Electrical-Installer EFZ.
vi: Chứng chỉ thực tập cho Lắp ráp Điện viên được chứng nhận EFZ.

source: Show game screenshots
vi: Hiển thị ảnh chụp màn hình trò chơi

source: Send
vi: Gửi

source: Statistics
vi: Thống kê

source: More knowledge
vi: Kiến thức thêm

source: Back
de: Zurück
vi: Quay lại

source: Snaptab is a smart all-in-one app designed to optimize business administration. From project management and time tracking to invoicing, snaptab automates administrative processes and saves valuable time.
vi: Snaptab là một ứng dụng thông minh tất cả trong một được thiết kế để tối ưu hóa quản lý doanh nghiệp. Từ quản lý dự án và theo dõi thời gian đến lập hóa đơn, snaptab tự động hóa các quy trình quản lý và tiết kiệm thời gian quý báu.

source: View Details
vi: Xem Chi Tiết

source: January 2024
vi: Tháng 1 năm 2024

source: A high-performance open-source image editor for Flutter, featuring multi-threading, CPU control, cropping, rotation, filters, text layers, pixelation, and non-destructive editing.
vi: Một trình chỉnh sửa hình ảnh mã nguồn mở hiệu suất cao cho Flutter, có tính năng đa luồng, kiểm soát CPU, cắt, xoay, bộ lọc, lớp văn bản, pixel hóa và chỉnh sửa không phá hủy.

source: December 2023
vi: Tháng 12 năm 2023

source: Open Source Angular Utilities
vi: Tiện ích mã nguồn mở Angular

source: A set of lightweight libraries for smooth scroll animations, immersive image transitions, and dynamic number effects—enhancing user experience with minimal effort.
vi: Một bộ thư viện nhẹ cho các hiệu ứng cuộn mượt mà, chuyển tiếp hình ảnh sống động và hiệu ứng số động—nâng cao trải nghiệm người dùng với nỗ lực tối thiểu.

source: Founded WAIO Applications
vi: Thành lập WAIO Applications

source: Developed various projects, including the company website and a management tool. Created a web app for “Schule Rotflue” to simplify the presentation of their pedagogical concept.
vi: Phát triển nhiều dự án, bao gồm trang web công ty và một công cụ quản lý. Tạo một ứng dụng web cho “Schule Rotflue” để đơn giản hóa việc trình bày khái niệm sư phạm của họ.

source: Project “Report-App” Ionic version
vi: Dự án “Report-App” phiên bản Ionic

source: I developed a report app with Ionic for craftsmen to simplify report creation and management. Lessons from this project laid the foundation for snaptab’s enhanced features and functionality.
vi: Tôi đã phát triển một ứng dụng báo cáo với Ionic cho thợ thủ công để đơn giản hóa việc tạo và quản lý báo cáo. Những bài học từ dự án này đã đặt nền tảng cho các tính năng và chức năng nâng cao của snaptab.

source: Mid-2018
vi: Giữa năm 2018

source: Completed a three-month training in Eschlikon at Bingesser Huber Elektro AG, gaining hands-on experience in fiber optic splicing, as well as outdoor and indoor installations.
vi: Hoàn thành khóa đào tạo ba tháng tại Eschlikon tại Bingesser Huber Elektro AG, thu được kinh nghiệm thực hành trong việc nối sợi quang, cũng như lắp đặt ngoài trời và trong nhà.

source: Mid-2017
vi: Giữa năm 2017

source: Project “Report-App” Java version
vi: Dự án “Report-App” phiên bản Java

source: My first major project, a simple report app built with Java and libGDX, developed for use at my workplace. It provided valuable experience in mobile development and future projects.
vi: Dự án lớn đầu tiên của tôi, một ứng dụng báo cáo đơn giản được xây dựng bằng Java và libGDX, phát triển cho công việc của tôi. Nó cung cấp kinh nghiệm quý giá trong phát triển di động và các dự án tương lai.

source: Early 2017
vi: Đầu năm 2017

source: Java Development and Game Programming
vi: Phát triển Java và Lập trình trò chơi

source: Learned programming with Java and developed an Endless Runner game using libGDX, gaining hands-on experience in game development and software design.
vi: Đã học lập trình với Java và phát triển một trò chơi Endless Runner sử dụng libGDX, thu được kinh nghiệm thực hành trong phát triển trò chơi và thiết kế phần mềm.

source: Endless Runner game
vi: Trò chơi Endless Runner

source: Development screenshots of the “Endless Runner” game that I programmed with libGDX.
vi: Ảnh chụp màn hình phát triển của trò chơi “Endless Runner” mà tôi lập trình bằng libGDX.

source: Game screen
vi: Màn hình trò chơi

source: Elektro Sutter – Electrical Installer
vi: Elektro Sutter – Lắp ráp Điện

source: Worked as an electrical installer, service technician, and project manager at Elektro Sutter. In 2018, transitioned to an 80% workload to dedicate more time to programming.
vi: Làm việc như một lắp ráp điện, kỹ thuật viên dịch vụ, và quản lý dự án tại Elektro Sutter. Năm 2018, chuyển sang công việc 80% để dành nhiều thời gian hơn cho lập trình.

source: Military Training
vi: Đào tạo quân sự

source: Completed basic training followed by advanced training to achieve the rank of Wachtmeister.
vi: Hoàn thành đào tạo cơ bản sau đó là đào tạo nâng cao để đạt được cấp bậc Wachtmeister.

source: Brunner & Engler – Electrical Installer
vi: Brunner & Engler – Lắp ráp Điện

source: Worked as an electrical installer, gaining hands-on experience in installations and electrical systems.
vi: Làm việc như một lắp ráp điện, thu được kinh nghiệm thực hành trong lắp đặt và hệ thống điện.

source: Apprenticeship – Certified Electrical Installer EFZ
vi: Thực tập – Lắp ráp Điện viên được chứng nhận EFZ

source: Completed a vocational apprenticeship, earning the EFZ certification as an electrical installer, with practical experience in electrical systems and installations.
vi: Hoàn thành một chương trình thực tập nghề nghiệp, đạt chứng chỉ EFZ với vai trò lắp đặt điện, có kinh nghiệm thực tiễn trong hệ thống và lắp đặt điện.

source: Elementary School
vi: Trường Tiểu Học

source: Completed basic primary education.
vi: Hoàn thành giáo dục tiểu học cơ bản.

source: Just a baby, no coding skills yet!
vi: Chỉ là một em bé, chưa có kỹ năng lập trình!

source: Crafting fast, responsive, and user-friendly websites with modern frameworks like Angular. Whether it's a portfolio, a business site, or a full-fledged web app, I build solutions that stand out.
vi: Xây dựng các trang web nhanh, mượt mà và thân thiện với người dùng bằng những framework hiện đại như Angular. Dù là trang portfolio, website doanh nghiệp hay ứng dụng web hoàn chỉnh, tôi đều phát triển những giải pháp nổi bật và hiệu quả.

source: Developing high-performance mobile applications with Flutter or Ionic. I focus on smooth user experiences and cross-platform compatibility to ensure apps work seamlessly on both iOS and Android.
vi: Phát triển các ứng dụng di động hiệu suất cao bằng Flutter hoặc Ionic. Tôi chú trọng vào trải nghiệm người dùng mượt mà và khả năng tương thích đa nền tảng, đảm bảo ứng dụng hoạt động ổn định trên cả iOS và Android.

source: Blending aesthetics with functionality. I create clean UI/UX designs that enhance usability and engage users, ensuring an intuitive and visually appealing digital experience.
vi: Kết hợp hài hòa giữa thẩm mỹ và chức năng. Tôi thiết kế giao diện (UI/UX) tối giản, rõ ràng, nâng cao khả năng sử dụng và thu hút người dùng, đảm bảo mang lại trải nghiệm số trực quan và hấp dẫn.

source: Building scalable and efficient backends with Node.js, Firebase, and Supabase. From APIs to databases, I make sure everything runs securely and smoothly behind the scenes.
vi: Xây dựng hệ thống backend hiệu quả, dễ mở rộng với Node.js, Firebase và Supabase. Từ API đến cơ sở dữ liệu, tôi đảm bảo tất cả đều vận hành ổn định, an toàn và mượt mà phía sau hậu trường.

source: Featured Projects
vi: Các Dự Án Nổi Bật

source: View All Projects
vi: Xem Tất Cả Các Dự Án

source: Details
vi: Chi Tiết

source: View Code
vi: Xem Mã

source: I see that you are trying to hack the game! <br /><br /> Even if you haven’t succeeded yet, taking that first step is the beginning of becoming a hacker. Let me give you a tip for success. <br /><br /> "Open the browser console and play around"
vi: Tôi thấy bạn đang cố gắng hack trò chơi! <br /><br /> Ngay cả khi bạn chưa thành công, bước đầu tiên đó là khởi đầu để trở thành một hacker. Hãy để tôi đưa cho bạn một mẹo để thành công. <br /><br /> "Mở bảng điều khiển trình duyệt và thử nghiệm"

source: Let's play a <span class="color-primary">mini-game</span> which I created to relax a bit!
vi: Hãy chơi một <span class="color-primary">trò chơi mini</span> mà tôi tạo ra để thư giãn một chút!

source: Imprint
vi: Dấu ấn

source: Privacy
vi: Quyền riêng tư

source: Knowledge
vi: Kiến thức

source: Intelligence
vi: Trí tuệ

source: Reaction
vi: Phản ứng

source: Focus
vi: Tập trung

source: A powerful, customizable Flutter image editor with multi-threading, localization, and a rich set of editing tools.
vi: Một trình chỉnh sửa hình ảnh Flutter mạnh mẽ, có thể tùy chỉnh với đa luồng, hỗ trợ bản địa hóa, và bộ công cụ chỉnh sửa phong phú.

source: The ProImageEditor is a versatile Flutter widget that enables seamless image editing within applications. It offers a comprehensive suite of tools, including painting, text insertion, cropping, filtering, and more. <br> The editor supports multi-threading through Dart isolates and web workers, ensuring efficient performance across platforms.<br> With customizable UI elements, localization support, and various design themes, ProImageEditor provides developers with a flexible and user-friendly solution for integrating image editing capabilities into their Flutter projects.
vi: ProImageEditor l&agrave; một widget Flutter đa năng cho ph&eacute;p chỉnh sửa h&igrave;nh ảnh mượt m&agrave; trong c&aacute;c ứng dụng. N&oacute; cung cấp một bộ c&ocirc;ng cụ to&agrave;n diện, bao gồm vẽ, ch&egrave;n văn bản, cắt, lọc, v&agrave; nhiều hơn nữa. <br> Tr&igrave;nh chỉnh sửa hỗ trợ đa luồng th&ocirc;ng qua Dart isolates v&agrave; web workers, đảm bảo hiệu suất hiệu quả tr&ecirc;n c&aacute;c nền tảng.<br> Với c&aacute;c yếu tố UI c&oacute; thể t&ugrave;y chỉnh, hỗ trợ bản địa h&oacute;a, v&agrave; nhiều chủ đề thiết kế kh&aacute;c nhau, ProImageEditor mang đến cho c&aacute;c nh&agrave; ph&aacute;t triển một giải ph&aacute;p linh hoạt v&agrave; th&acirc;n thiện với người d&ugrave;ng để t&iacute;ch hợp khả năng chỉnh sửa h&igrave;nh ảnh v&agrave;o c&aacute;c dự &aacute;n Flutter của họ.

source: A native-code Flutter video editor with trimming, cropping, and effects across platforms.
vi: Một trình chỉnh sửa video Flutter bằng mã gốc với cắt, cắt xén, và hiệu ứng trên nhiều nền tảng.

source: ProVideoEditor is a native-code Flutter plugin for advanced video editing across all major platforms. It offers features like trimming, cropping, scaling, rotation, flipping, and adding visual effects or overlays, all implemented using platform-native APIs for maximum performance and compatibility.<br> Unlike FFmpeg-based solutions, this editor is optimized for real-time responsiveness and supports concurrent processing, making it ideal for demanding video editing tasks in mobile and desktop applications.
vi: ProVideoEditor l&agrave; một plugin Flutter bằng m&atilde; gốc cho chỉnh sửa video n&acirc;ng cao tr&ecirc;n tất cả c&aacute;c nền tảng ch&iacute;nh. N&oacute; cung cấp c&aacute;c t&iacute;nh năng như cắt, cắt x&eacute;n, thay đổi tỷ lệ, xoay, lật, v&agrave; th&ecirc;m hiệu ứng h&igrave;nh ảnh hoặc lớp phủ, tất cả đều được thực hiện bằng c&aacute;ch sử dụng API gốc của nền tảng để đạt hiệu suất v&agrave; khả năng tương th&iacute;ch tối đa.<br> Kh&ocirc;ng giống như c&aacute;c giải ph&aacute;p dựa tr&ecirc;n FFmpeg, tr&igrave;nh chỉnh sửa n&agrave;y được tối ưu h&oacute;a cho khả năng phản hồi theo thời gian thực v&agrave; hỗ trợ xử l&yacute; đồng thời, l&agrave;m cho n&oacute; l&yacute; tưởng cho c&aacute;c nhiệm vụ chỉnh sửa video căng thẳng trong c&aacute;c ứng dụng di động v&agrave; m&aacute;y t&iacute;nh để b&agrave;n.

source: A smart web and mobile app for craftsmen with time tracking, scheduling, invoicing, and Stripe payments.
vi: Một ứng dụng web và di động thông minh cho các nghệ nhân với theo dõi thời gian, lập lịch, lập hóa đơn, và thanh toán Stripe.

source: My company site featuring two hidden games, an image conversion tool, and a fast, accessible, fully responsive design.
vi: Trang web công ty của tôi với hai trò chơi ẩn, một công cụ chuyển đổi hình ảnh, và một thiết kế nhanh, dễ tiếp cận, hoàn toàn phản hồi.

source: A package for smooth, animated number transitions, ideal for counters and real-time data updates.
vi: Một gói cho các chuyển tiếp số mượt mà, lý tưởng cho các bộ đếm và cập nhật dữ liệu theo thời gian thực.

source: A package for smooth hero animations, letting users tap images to zoom into an immersive full-screen view.
vi: Một gói cho các hoạt ảnh hero mượt mà, cho phép người dùng chạm vào hình ảnh để phóng to vào chế độ xem toàn màn hình hấp dẫn.

source: A CSS scroll animation package with customizable or pre-built effects that trigger on viewport entry, once or multiple times.
vi: Một gói hoạt ảnh cuộn CSS với các hiệu ứng có thể tùy chỉnh hoặc được xây dựng sẵn được kích hoạt khi vào vùng xem, một lần hoặc nhiều lần.

source: A real-time control app for managing GPIO ports and monitoring personal beehives, with no coding required.
vi: Một ứng dụng điều khiển theo thời gian thực cho việc quản lý các cổng GPIO và giám sát tổ ong cá nhân, không yêu cầu mã hóa.

source: This project is a real-time control application designed to simplify hardware interaction. It allows users to configure and control GPIO ports through an intuitive interface—no programming skills needed. <br> Beyond GPIO control, the app also connects to a personal beehive system, providing live data such as internal temperature and honey production levels. This combination of real-time control and smart monitoring makes it a powerful tool for hobbyists and makers alike.
vi: Dự &aacute;n n&agrave;y l&agrave; một ứng dụng điều khiển theo thời gian thực được thiết kế để đơn giản h&oacute;a việc tương t&aacute;c với phần cứng. N&oacute; cho ph&eacute;p người d&ugrave;ng cấu h&igrave;nh v&agrave; điều khiển c&aacute;c cổng GPIO th&ocirc;ng qua một giao diện trực quan&mdash;kh&ocirc;ng cần kỹ năng lập tr&igrave;nh. <br> Ngo&agrave;i việc điều khiển GPIO, ứng dụng c&ograve;n kết nối với hệ thống tổ ong c&aacute; nh&acirc;n, cung cấp dữ liệu trực tiếp như nhiệt độ b&ecirc;n trong v&agrave; mức sản xuất mật. Sự kết hợp giữa điều khiển theo thời gian thực v&agrave; gi&aacute;m s&aacute;t th&ocirc;ng minh biến n&oacute; th&agrave;nh một c&ocirc;ng cụ mạnh mẽ cho cả những người đam m&ecirc; v&agrave; nh&agrave; sản xuất.

source: A modern, responsive website for a sushi and bubble tea bar, focused on fresh ingredients and modern design.
vi: Một trang web hiện đại, đáp ứng cho quán sushi và trà sủi bọt, tập trung vào nguyên liệu tươi và thiết kế hiện đại.

source: Umami House is a stylish and fully responsive website developed for a sushi and bubble tea bar located in the heart of Zurich. The site was designed to reflect the brand’s focus on high-quality ingredients, modern presentation, and a welcoming atmosphere. Visitors can explore the full menu, learn about the restaurant’s concept, and easily find essential information like location and opening hours. <br><br> The website is built with performance and user experience in mind, ensuring fast load times and seamless navigation across all devices. Special attention was given to responsive design, accessibility, and clean visual aesthetics. The project highlights how a well-crafted digital presence can elevate a local business and connect with a broader audience.
vi: Umami House l&agrave; một trang web thời trang v&agrave; ho&agrave;n to&agrave;n đ&aacute;p ứng được ph&aacute;t triển cho một qu&aacute;n sushi v&agrave; tr&agrave; sủi bọt nằm ở trung t&acirc;m Zurich. Trang web được thiết kế để phản &aacute;nh trọng t&acirc;m của thương hiệu v&agrave;o nguy&ecirc;n liệu chất lượng cao, tr&igrave;nh b&agrave;y hiện đại v&agrave; bầu kh&ocirc;ng kh&iacute; th&acirc;n thiện. Kh&aacute;ch truy cập c&oacute; thể kh&aacute;m ph&aacute; to&agrave;n bộ thực đơn, t&igrave;m hiểu về kh&aacute;i niệm của nh&agrave; h&agrave;ng v&agrave; dễ d&agrave;ng t&igrave;m thấy th&ocirc;ng tin cần thiết như vị tr&iacute; v&agrave; giờ mở cửa. <br><br> Trang web được x&acirc;y dựng với hiệu suất v&agrave; trải nghiệm người d&ugrave;ng trong t&acirc;m tr&iacute;, đảm bảo thời gian tải nhanh v&agrave; điều hướng mượt m&agrave; tr&ecirc;n tất cả c&aacute;c thiết bị. Sự ch&uacute; &yacute; đặc biệt đ&atilde; được d&agrave;nh cho thiết kế đ&aacute;p ứng, khả năng tiếp cận v&agrave; thẩm mỹ h&igrave;nh ảnh sạch sẽ. Dự &aacute;n nhấn mạnh c&aacute;ch m&agrave; sự hiện diện kỹ thuật số được thiết kế tốt c&oacute; thể n&acirc;ng cao một doanh nghiệp địa phương v&agrave; kết nối với một đối tượng rộng lớn hơn.

source: June 2025
vi: Tháng 6 năm 2025

source: A modern, responsive website for a sushi and bubble tea bar, focused on fresh ingredients and modern design
vi: Một trang web hiện đại, đáp ứng cho quán sushi và trà sủi bọt, tập trung vào nguyên liệu tươi và thiết kế hiện đại

source: Mai 2025
vi: Tháng 5 năm 2025

source: A cross-platform video editor built with Flutter and native code integration, offering powerful features such as trimming, cropping, and visual effects. Designed for high performance and native-like user experience on Android, iOS, macOS, Windows, and the Web.
vi: Một trình biên tập video đa nền tảng được xây dựng với Flutter và tích hợp mã gốc, cung cấp các tính năng mạnh mẽ như cắt, cắt xén và hiệu ứng hình ảnh. Được thiết kế cho hiệu suất cao và trải nghiệm người dùng giống như gốc trên Android, iOS, macOS, Windows và Web.

source: Rotflue School Educational Concept
vi: Khái niệm Giáo dục Trường Rotflue

source: A digital prototype of the educational concept that is accessible online. Parents can inform themselves at any time about the educational principles and goals, which promotes greater transparency and trust. At the same time, teachers have the opportunity to edit the concept directly online, adapt content, and collaboratively develop it further.
vi: Một nguyên mẫu kỹ thuật số của khái niệm giáo dục có thể truy cập trực tuyến. Phụ huynh có thể tự thông tin vào bất kỳ lúc nào về các nguyên tắc và mục tiêu giáo dục, điều này thúc đẩy sự minh bạch và tin cậy hơn. Đồng thời, giáo viên có cơ hội chỉnh sửa khái niệm trực tiếp trực tuyến, điều chỉnh nội dung và phát triển nó một cách hợp tác hơn.

source: Full Stack Developer with a background in electrical engineering and a passion for building high-performance web and mobile applications. I am the sole developer of the app snaptab and the maintainer of the Flutter open-source libraries pro_image_editor and pro_video_editor.
vi: Lập trình viên Full Stack với nền tảng kỹ thuật điện và đam mê xây dựng các ứng dụng web và di động hiệu suất cao. Tôi là lập trình viên duy nhất của ứng dụng snaptab và là người bảo trì các thư viện mã nguồn mở Flutter pro_image_editor và pro_video_editor.

source: Alex Frei profil picture
de: Alex Frei Profilbild

source: Social-Github
de: Sozial-Github

source: Social-Facebook
de: Sozial-Facebook

source: Social-X aka Twitter
de: Sozial-X alias Twitter

source: Contact
de: Kontakt

source: I'm the one who loves the silence of the wilderness, follows the call of the birds and experiences nature as his own symphony.
de: Ich bin derjenige, der die Stille der Wildnis liebt, dem Ruf der Vögel folgt und die Natur als seine eigene Sinfonie erlebt.

source: Travel
de: Reisen

source: I love to travel and explore new places, meet new people and learn about different cultures. I'm always ready for a new adventure.
de: Ich liebe es, zu reisen und neue Orte zu erkunden, neue Menschen kennenzulernen und mehr über andere Kulturen zu erfahren. Ich bin immer bereit für ein neues Abenteuer.

source: Hey, I'm Alex, a passionate software developer focused on turning ideas into elegant, functional solutions. Whether it's web development, mobile apps, or exploring the latest technology, I'm driven by a love of innovation and problem solving. Let's connect and bring your projects to life!
de: Hey, mein Name ist Alex und ich bin ein leidenschaftlicher Softwareentwickler, der sich darauf konzentriert, Ideen in elegante, funktionale Lösungen zu verwandeln. Egal, ob es um Webentwicklung, mobile Anwendungen oder die Erforschung der neuesten Technologien geht, meine Liebe zur Innovation und Problemlösung treibt mich an. Lass uns zusammenarbeiten und Ihre Projekte zum Leben erwecken!

source: As a dedicated web developer, I specialize in crafting visually stunning and fully functional websites. Whether you're looking to establish your online presence or enhance your existing site, I ensure top-notch quality and user satisfaction.
de: Als engagierter Webentwickler bin ich darauf spezialisiert, optisch ansprechende und voll funktionsfähige Webseiten zu erstellen. Ganz gleich, ob Sie Ihre Online-Präsenz aufbauen oder Ihre bestehende Webseite verbessern möchten, ich garantiere erstklassige Qualität und Benutzerzufriedenheit.

source: With my expertise in mobile and web app development, I create innovative solutions tailored to your needs. From concept to launch, I prioritize usability and performance, delivering apps that stand out in today's competitive market.
de: Mit meiner Erfahrung in der Entwicklung von mobilen und Web-Apps schaffe ich innovative Lösungen, die auf Ihre Bedürfnisse zugeschnitten sind. Vom Konzept bis zur Markteinführung lege ich Wert auf Benutzerfreundlichkeit sowie ausgezeichnete Leistung und erstelle Apps, die sich auf dem heutigen wettbewerbsorientierten Markt abheben.

source: As a backend developer, I architect robust and scalable systems to power your applications. From database design to server-side logic, I ensure seamless functionality and reliability.
de: Als Backend-Entwickler konzipiere ich robuste und skalierbare Systeme für Ihre Anwendungen. Vom Datenbankdesign bis zur serverseitigen Logik sorge ich für nahtlose Funktionalität und Zuverlässigkeit.

source: What I prefer
de: Was ich bevorzuge

source: Various
de: Allgemein

source: Submit
de: Senden

source: Call
de: Anrufen

source: Business Projects
de: Geschäftsprojekte

source: The <span class="snaptab-primary">Allrounder-Tool</span> for <br class="break-before" /> your<br class="break-after" /> <af-typewriter class="snaptab-primary" [items]="items" /><af-typewriter class="snaptab-primary" [items]="items" />
de: Das <span class="snaptab-primary">Allrounder-Tool</span> für <br class="break-before" /> deine<br class="break-after" /> <af-typewriter class="snaptab-primary" [items]="items" /><af-typewriter class="snaptab-primary" [items]="items" />

source: From project tracking to the completed QR invoice - that's what <b>snaptab</b> offers you. All important documentation regarding your projects and employees is created, giving you full control at all times!
de: Von der Erfassung von Projekten bis zur Erstellung der QR-Rechnung bietet dir <b>snaptab</b> eine umfassende Lösung. Dabei werden alle relevanten Dokumente in Bezug auf deine Projekte und Mitarbeiter erstellt, und du behältst jederzeit die volle Kontrolle und Übersicht!

source: Company!
de: Firma!

source: Projects!
de: Projekte!

source: Needs!
de: Bedürfnisse!
