Repository: hm21/alex-frei-cv
Catalog: src/locale/messages.*.xlf
Languages: de, vi

source: Back button
de: Zurück Button
vi: Nút quay lại

source: Next Recommended Pages
de: Nächste empfohlene Seiten
vi: Trang gợi ý tiếp theo

source: en
de: de
vi: vi

source: Open sidemenu
de: Seitenmenü öffnen
vi: Mở menu bên cạnh

source: About me
de: Über mich
vi: Về tôi

source: Resume
de: Lebenslauf
vi: Sơ yếu lý lịch

source: Portfolio
vi: Danh mục

source: Relax
de: Erholung
vi: Thư giãn

source: Contact
de: Kontakt
vi: Liên lạc

source: View source code
de: Quellcode anzeigen
vi: Xem mã nguồn

source: About Alex Frei
de: Über Alex Frei
vi: Giới thiệu về Alex Frei

source: Learn more about Alex Frei
de: Erfahre mehr über Alex Frei
vi: Tìm hiểu thêm về Alex Frei

source: Hiking
de: Wandern
vi: Đi bộ đường dài

source: Develop
de: Entwickeln
vi: Phát triển

source: As electronics enthusiast i spend my free time drawing schematics, writing code and turning my apartment into a high-tech lab.
de: Als Elektronik-Enthusiast verbringe ich meine Freizeit damit, Schaltpläne zu zeichnen, Code zu schreiben und meine Wohnung in ein High-Tech-Labor zu verwandeln.
vi: Là người đam mê ngành kĩ thuật điện tử, tôi dành phần lớn thời gian rảnh rỗi của mình để vẽ , thiết kế, lập trình sơ đồ và biến căn phòng nhỏ của mình như một phòng thí nghiệm công nghệ cao.

source: Phone
de: Telefon
vi: Số điện thoại

source: Location
de: Standort
vi: Địa chỉ

source: Languages
de: Sprachen
vi: Ngôn ngữ

source: German, English
de: Deutsch, Englisch
vi: Tiếng Đức, Tiếng Anh

source: Age
de: Alter
vi: Tuổi

source: UI/ UX Designer
vi: Nhà thiết kế UI/UX

source: What I do
de: Was ich mache
vi: Những gì tôi làm

source: Websites
de: Webseiten
vi: Trang web

source: Apps
vi: Ứng dụng

source: Design
vi: Thiết kế

source: Fun-Facts
vi: Những sự thật thú vị

source: About this Website
de: Von dieser Webseite
vi: Về trang web này

source: Coffee Consumed
de: Kaffee konsumiert
vi: Lượng cà phê đã uống

source: Walking Breaks
de: Laufpausen
vi: Giải lao đi bộ

source: Songs listened
de: Gehörte Lieder
vi: Bài hát đã nghe

source: First Name
de: Vorname
vi: Tên

source: Last Name
de: Nachname
vi: Họ

source: Message
de: Nachricht
vi: Lời nhắn

source: The request has been successfully submitted.
de: Die Nachricht wurde erfolgreich übermittelt.
vi: Yêu cầu đã được gửi thành công.

source: Unknown error! Please try again.
de: Unbekannter Fehler! Bitte versuchen Sie es erneut.
vi: Lỗi không xác định! Vui lòng thử lại.

source: Forbidden request to the server.
de: Verbotene Anfrage an den Server.
vi: Yêu cầu bị cấm đối với máy chủ.

source: Invalid data sent. Please fill out the form correctly and try again.
de: Ungültige Daten gesendet. Bitte füllen Sie das Formular korrekt aus und versuchen Sie es erneut.
vi: Đã gửi dữ liệu không hợp lệ. Vui lòng điền vào biểu mẫu một cách chính xác và thử lại.

source: Open WhatsApp
de: WhatsApp öffnen
vi: Mở WhatsApp

source: Start call
de: Anruf starten
vi: Bắt đầu cuộc gọi

source: Send E-Mail
de: E-Mail senden
vi: Gửi E-Mail

source: Alternatively, you can get in touch via the contact form.
de: Alternativ können Sie sich auch über das Kontaktformular an mich wenden.
vi: Ngoài ra, bạn có thể liên lạc qua biểu mẫu liên hệ.

source: Contact Alex Frei
de: Kontaktiere Alex Frei
vi: Liên hệ với Alex Frei

source: Contact Alex Frei right now.
de: Kontaktiere Alex Frei jetzt gleich.
vi: Hãy liên hệ ngay với Alex Frei.

source: Presentation website
de: Präsentationswebseite
vi: Trình bày trang web

source: Web-app
vi: Ứng dụng web

source: Mobile-web-app “PWA”
vi: Ứng dụng web dành cho thiết bị di động “PWA”

source: Client-portal
de: Kundenportal
vi: Cổng thông tin khách hàng

source: Admin-access
de: Admin-Zugriff
vi: Quyền truy cập của quản trị viên

source: Website
de: Webseite
vi: Trang mạng

source: Waio Homepage
de: Waio Webseite
vi: Trang chủ của Waio

source: Waio Team
vi: Nhóm Waio

source: Waio Game 1
de: Waio Spiel 1
vi: Trò chơi Waio 1

source: Waio Game 2
de: Waio Spiel 2
vi: Trò chơi Waio 2

source: Flutter open source
vi: Flutter mã nguồn mở

source: Github-Page
de: Github-Seite
vi: Trang Github

source: Close
de: Schließen
vi: Đóng

source: Demo
vi: Thử nghiệm

source: Install
de: Installieren
vi: Cài đặt

source: Copied
de: Kopieren
vi: Đã sao chép

source: Technology
de: Technologie
vi: Công nghệ

source: YouTube video
vi: Video trên YouTube

source: Mobile-Store
vi: Cửa hàng di động

source: Prototype
de: Prototyp
vi: Nguyên mẫu

source: Other
de: Sonstiges
vi: Khác

source: All the projects listed below were both designed and coded exclusively by me.
de: Alle unten aufgeführten Projekte sind ausschließlich von mir entworfen und programmiert.
vi: Tất cả các dự án liệt kê dưới đây đều do tôi thiết kế và lập trình, viết mã độc quyền.

source: Portfolio Alex Frei
vi: Danh mục đầu tư Alex Frei

source: Attempt to keep your mind under control without getting confused.
de: Versuchen Sie, Ihren Verstand unter Kontrolle zu halten, ohne verwirrt zu werden.
vi: Hãy cố gắng tập trung điều khiển bộ não để không bị nhầm lẫn.

source: Evaluation
de: Auswertung
vi: Đánh giá

source: Congratulations, you scored {{ points() }} points and {{ mistakes() }} mistakes! <br /><br /><span [innerHTML]="msg"></span>@if (highScoreMsg) {<br /><br /> {{ highScoreMsg }} }
vi: Xin chúc mừng, bạn đã ghi điểm số {{ points }} điểm và {{ mistakes }} lỗi! <br /><br /><span [innerHTML]="msg()"></span>@if (highScoreMsg()) {<br /><br /> {{ highScoreMsg() }} }

source: Play again
de: Erneut spielen
vi: Chơi lại

source: You made a lot of mistakes. Take it slow next time, I'm sure you can get better!
de: Sie haben zu viele Fehler gemacht. Lassen Sie es das nächste Mal langsam angehen, ich bin mir sicher, dass Sie besser werden können!
vi: Bạn đã mắc rất nhiều lỗi. Lần sau hãy từ từ nhé, tôi chắc chắn bạn sẽ khá hơn!

source: Not bad, you just made a few mistakes. But can you also do it without any mistakes?
de: Nicht schlecht, Sie haben nur ein paar Fehler gemacht. Aber schaffen Sie es auch fehlerfrei?
vi: Không tệ, bạn chỉ mắc một vài lỗi thôi. Nhưng liệu bạn có thể làm được điều đó mà không mắc bất kỳ sai sót nào không?

source: Great job, you didn't make any mistakes. But can you score more points in that time without making any mistakes?
de: Toll, Sie haben keine Fehler gemacht. Aber können Sie in dieser Zeit mehr Punkte erzielen, ohne Fehler zu machen?
vi: Làm tốt lắm, bạn không mắc lỗi nào cả. Nhưng liệu bạn có thể ghi được nhiều điểm hơn trong khoảng thời gian đó mà không lỗi nào không?

source: Your current high score is highScore.points points with highScore.mistakes mistakes!
de: Ihr aktueller Highscore beträgt highScore.points Punkte mit highScore.mistakes Fehlern!
vi: Điểm cao hiện tại của bạn là highScore.points điểm với highScore.mistakes lỗi!

source: Warm-up laps
de: Aufwärmrunden
vi: Vòng khởi động

source: Show Instruction
de: Anleitung anzeigen
vi: Hiển thị hướng dẫn

source: One
de: Eins
vi: Một

source: Two
de: Zwei
vi: Hai

source: Three
de: Drei
vi: Ba

source: Four
de: Vier
vi: Bốn

source: Five
de: Fünf
vi: Năm

source: Six
de: Sechs
vi: Sáu

source: Seven
de: Sieben
vi: Bảy

source: Eight
de: Acht
vi: Tám

source: Nine
de: Neun
vi: Chín

source: Rectangle
de: Rechteck
vi: Hình chữ nhật

source: Circle
de: Kreis
vi: Vòng tròn

source: Triangle
de: Dreieck
vi: Tam giác

source: Instruction
de: Anleitung
vi: Hướng dẫn

source: Choose a topic
de: Wähle ein Thema
vi: Chọn một chủ đề

source: You can choose your own topic. For example, you can enter "Soccer" or "Angular," from which a unique quiz will be generated for you. Alternatively, you can also press "Random" below to select a random topic.
de: Sie können Ihr eigenes Thema auswählen. Beispielsweise können Sie „Fußball“ oder „Angular“ eingeben, woraus ein einzigartiges Quiz für Sie generiert wird. Alternativ können Sie auch unten auf „Zufällig“ klicken, um ein zufälliges Thema auszuwählen.
vi: Bạn có thể tự chọn chủ đề cho riêng mình. Ví dụ: bạn có thể nhập "Bóng đá" hoặc "Angular", từ đó một bài kiểm tra duy nhất sẽ được tạo cho bạn. Ngoài ra, bạn cũng có thể nhấn "Ngẫu nhiên" bên dưới để chọn chủ đề ngẫu nhiên.

source: Insert a topic like Angular or Soccer
de: Geben Sie ein Thema wie Angular oder Fußball ein
vi: Chèn một chủ đề như Angular hoặc Bóng đá

source: Random
de: Zufällig
vi: Ngẫu nhiên

source: Generate
de: Generieren
vi: Tạo

source: The topic must be between 3 and 20 characters long!
de: Das Thema muss zwischen 3 und 20 Zeichen lang sein!
vi: Chủ đề phải dài từ 3 đến 20 ký tự!

source: The topic must be a text and not a number
de: Das Thema muss ein Text und keine Zahl sein
vi: Chủ đề phải là văn bản chứ không phải số

source: Question
de: Frage
vi: Câu hỏi

source: Correct
de: Korrekt
vi: Chính xác

source: Great job! Your answer is correct!
de: Gut gemacht! Ihre Antwort ist richtig!
vi: Làm tốt lắm! Câu trả lời của bạn là chính xác!

source: Continue
de: Weiter
vi: Tiếp tục

source: Wrong
de: Falsch
vi: Sai

source: I'm sorry, but the correct answer was <b>{{ correctAnswerLetter() }}</b >.
vi: Tôi xin lỗi, nhưng câu trả lời đúng là Tôi xin lỗi, nhưng câu trả lời đúng là <b>{{ correctAnswerLetter() }}</b >.

source: Okay
vi: Được rồi

source: Option A
de: Antwort A
vi: Phương án A

source: Option B
de: Antwort B
vi: Phương án B

source: Option C
de: Antwort C
vi: Phương án C

source: Option D
de: Antwort D
vi: Phương án D

source: Enter
de: Eingabe
vi: Nhập

source: Confirm
de: Bestätigen
vi: Xác nhận

source: This game is like the quiz show "Who Wants to Be a Millionaire." You will try to win the million, but you choose the topic. <br /><br /> If you're unfamiliar, the rules of this quiz game are quite simple. You attempt to answer as many questions as possible until the one-million question, which progressively get more difficult. You always choose between four answers, where only one answer is correct.
de: In diesem Spiel, das dem Format von „Wer wird Millionär“ ähnelt, ist es Ihr Ziel, die Million in Ihrem selbst gewählten Thema zu gewinnen. <br /><br /> Wenn Sie mit diesem Quizspiel nicht vertraut sind, sind die Regeln einfach: Beantworten Sie so viele Fragen wie möglich, bis Sie eine Million erreichen. Die Fragen werden jedoch zunehmend schwieriger, und Sie wählen immer aus vier Antworten, wobei nur eine richtig ist.
vi: Trò chơi này giống như chương trình đố vui "Ai là triệu phú". Bạn sẽ cố gắng giành được một triệu, nhưng bạn chọn chủ đề. <br /><br /> Nếu bạn chưa quen thì luật chơi của trò chơi đố vui này khá đơn giản. Bạn cố gắng trả lời càng nhiều câu hỏi càng tốt cho đến khi đến câu hỏi thứ một triệu, độ khó tăng dần. Bạn luôn phải chọn giữa bốn câu trả lời, trong đó chỉ có một câu trả lời đúng.

source: It seems like you still have more to learn about this topic before you can master it. Try a new topic, and let's see if you can win more than {{ +wonCash() | number: "1.2-2" }} CHF there.
vi: Có vẻ như bạn vẫn còn nhiều điều phải tìm hiểu về chủ đề này trước khi có thể thành thạo nó. Hãy thử một chủ đề mới và xem liệu bạn có thể giành được nhiều điểm hơn không nhé.

source: Waooo you won!
de: Waoooo, Sie haben gewonnen!
vi: Wao bạn đã thắng rồi!

source: It seems that you are a genius in this topic, congratulations! However, I have some disappointing news: I'm not rich, so you haven't won a million. The only reward you'll receive is the experience and enjoyment you've had ;)
de: Es scheint, dass Sie ein Genie in diesem Thema sind, herzlichen Glückwunsch! Allerdings habe ich eine schlechte Nachricht: Ich bin nicht reich, also haben Sie keine Million gewonnen. Die einzige Belohnung, die Sie erhalten, ist die Erfahrung und Freude, die Sie in diesem Spiel hatten ;)
vi: Có vẻ như bạn là thiên tài trong chủ đề này, xin chúc mừng! Tuy nhiên, tôi có một tin đáng thất vọng: Tôi không giàu nên bạn chưa giành được một triệu. Phần thưởng duy nhất bạn nhận được là trải nghiệm và niềm vui ;)

source: Can you emerge victorious on the millionaire show with your AI-generated topic?
de: Können Sie mit einem von Ihnen ausgewählten KI-generierten Thema in der Millionärsshow als Sieger hervorgehen?
vi: Bạn có thể giành chiến thắng trong chương trình triệu phú với chủ đề do AI tạo ra không?

source: Unknown error occurs
de: Unbekannter Fehler ist aufgetreten
vi: Xảy ra lỗi không xác định

source: Do you feel tired about checking out a lot of CVs?
de: Fühlen Sie sich erschöpft vom Lesen vieler Bewerbungen?
vi: Bạn có cảm thấy mệt mỏi khi phải xem quá nhiều CV ?

source: Time to relax and play
de: Zeit zum Entspannen und Spielen
vi: Thời gian để thư giãn và vui chơi

source: Let's play a mini-game to relax a bit!
de: Spiel doch ein Minispiel, um ein wenig zu entspannen!
vi: Cùng chơi một trò chơi nhỏ để thư giãn chút nhé!

source: March 21, 1995
de: 21. März 1995
vi: Ngày 21 tháng 3 năm 1995

source: Birthday
de: Geburtstag
vi: Sinh nhật

source: March - November 2015
de: März - November 2015
vi: Tháng 3 - tháng 11 năm 2015

source: Fiber optic training
de: Glasfaserschulung
vi: Đào tạo về cáp quang

source: 2021 - Today
de: 2021 - Heute
vi: 2021- Hiện tại

source: Project “snaptab”
de: Projekt “snaptab”
vi: Dự án “snaptab”

source: Resume Alex Frei
de: Lebenslauf Alex Frei
vi: Sơ yếu lý lịch của Alex Frei

source: Take a look on the resume from Alex Frei.
de: Schauen Sie sich den Lebenslauf von Alex Frei an.
vi: Hãy cùng xem sơ yếu lý lịch của Alex Frei một chút nhé

source: Take a look at the portfolio to know more about Alex Frei
de: Schauen Sie sich das Portfolio von Alex Frei an, um mehr über Ihn zu erfahren
vi: Hãy nhìn vào portfolio để biết thêm về Alex Frei

source: Learn more about me.
de: Mehr über mich.
vi: Tìm hiểu thêm về tôi.

source: View my resume.
de: Einblicke in Lebenslauf.
vi: Xem hồ sơ của tôi.

source: Explore my portfolio.
de: Erkunde mein Portfolio.
vi: Khám phá portfolio của tôi.

source: Take a break and relax.
de: Mach eine Pause und entspanne.
vi: Nghỉ ngơi và thư giãn.

source: Get in touch with me.
de: Kontakt mit mir aufnehmen.
vi: Liên lạc với tôi.

source: My hobbies
de: Meine Hobbies
vi: Sở thích của tôi

source: Swiming
vi: Bơi lội

source: What could be more relaxing than a refreshing swim? And swimming counts as exercise, so it's the perfect win-win for body and mind.
vi: Còn gì thư giãn hơn việc được bơi lội một cách sảng khoái? Và bơi lội được coi là như là một môn thể dục, vì vậy đây là sự lựa chọn hoàn hảo nhất cho cơ thể và tinh thần.

source: Color
vi: Màu sắc

source: Meaning
vi: Ý nghĩa

source: Oops you lose!
vi: Rất tiếc, bạn đã thua!

source: I am one of those people who love the silence of the wilderness, following the call of the birds and experiencing nature as a unique symphony.
vi: Tôi là một người yêu thích sự tĩnh lặng nhưng cũng thích được thưởng thức tiếng hát líu lo của các loài chim và thích được hoà mình trải nghiệm bản giao hưởng của thiên nhiên đất trời

source: One moment please <br /><br /> The quiz will be generated. This usually takes less than 5 seconds.
vi: Xin vui lòng đợi một lát <br /><br /> Câu đố sẽ được tạo. Quá trình này thường mất ít hơn 5 giây.

source: &nbspThe goal is to score more than 60 points without any mistakes!
vi: &nbsp Mục tiêu là ghi được hơn 60 điểm mà không mắc bất kỳ sai sót nào!

source: &nbspBut wait a minute, you got more than 60 points?!! That's awesome, seems like you're a genius!
vi: &nbspNhưng chờ đã, bạn có hơn 60 điểm à?!! Điều đó thật tuyệt vời, có vẻ như bạn là thiên tài!

source: The application snaptab was primarily developed for craftsmen and offers a wide range of features. From time tracking to scheduling appointments, tasks, project workflows, and even creating invoices and quotes, everything is provided. All of this is enhanced with artificial intelligence and the ability to collect payments directly from customers using Stripe. Through the customer portal, customers can directly access data shared by the company. <br><br> The application is offered as a web app as well as a mobile app for Android and iOS.
vi: Ứng dụng snaptab chủ yếu được thiết kế cho thợ thủ c&ocirc;ng v&agrave; cung cấp nhiều t&iacute;nh năng kh&aacute;c nhau. Từ theo d&otilde;i thời gian đến l&ecirc;n lịch cuộc hẹn, nhiệm vụ, quy tr&igrave;nh c&ocirc;ng việc của dự &aacute;n v&agrave; thậm ch&iacute; tạo h&oacute;a đơn v&agrave; b&aacute;o gi&aacute;, mọi thứ đều được cung cấp. Tất cả điều n&agrave;y được tăng cường nhờ AL v&agrave; khả năng thu thanh to&aacute;n trực tiếp từ kh&aacute;ch h&agrave;ng sử dụng Stripe. Th&ocirc;ng qua cổng th&ocirc;ng tin kh&aacute;ch h&agrave;ng, kh&aacute;ch h&agrave;ng c&oacute; thể truy cập trực tiếp v&agrave;o dữ liệu được c&ocirc;ng ty chia sẻ. <br><br> ứng dụng được cung cấp dưới dạng tr&igrave;nh duyệt web cũng như tr&igrave;nh duyệt di động d&agrave;nh cho hệ điều h&agrave;nh Android v&agrave; iOS.

source: This website introduces WAIO Applications, my own company. Alongside information about my company, it offers two captivating games to enrich the user experience.<br> You can find one of these games by clicking on the "Team" tab and then pressing the "Icebreaker" button. The other game is hidden as an "easter egg" on the homepage. Simply scroll to the "For all devices" section, click on the red rectangle (which represents a phone with a scale animation).<br><br> On the subdomain image.waio.ch, we provide a straightforward tool for resizing and converting images to various formats and sizes.<br><br> The website was designed with a focus on performance and accessibility, and it is fully responsive, ensuring a seamless experience across all devices.<br><br> Most of the UI/UX part of this project is not mine.
vi: Trang web n&agrave;y giới thiệu về WAIO, c&ocirc;ng ty ri&ecirc;ng của t&ocirc;i. B&ecirc;n cạnh th&ocirc;ng tin về c&ocirc;ng ty của t&ocirc;i, phần dưới c&ograve;n cung cấp hai tr&ograve; chơi hấp dẫn để l&agrave;m phong ph&uacute; th&ecirc;m trải nghiệm của người d&ugrave;ng.<br> Bạn c&oacute; thể t&igrave;m thấy một trong những tr&ograve; chơi n&agrave;y bằng c&aacute;ch nhấn v&agrave;o n&uacute;t "Đội" v&agrave; sau đ&oacute; nhấn n&uacute;t "T&agrave;u ph&aacute; băng". Tr&ograve; chơi c&ograve;n lại được ẩn dưới dạng "quả trứng Phục sinh" tr&ecirc;n trang chủ. Chỉ cần k&eacute;o đến phần "D&agrave;nh cho tất cả thiết bị", nhấn v&agrave;o h&igrave;nh chữ nhật m&agrave;u đỏ (biểu thị một chiếc điện thoại c&oacute; h&igrave;nh ảnh động tỷ lệ).<br><br> Tr&ecirc;n miền phụ image.waio.ch, ch&uacute;ng t&ocirc;i cung cấp một c&ocirc;ng cụ đơn giản để thay đổi k&iacute;ch thước v&agrave; chuyển đổi h&igrave;nh ảnh sang nhiều định dạng v&agrave; k&iacute;ch cỡ kh&aacute;c nhau.<br><br> Trang web được thiết kế tập trung v&agrave;o hiệu suất v&agrave; khả năng truy cập, đồng thời n&oacute; ho&agrave;n to&agrave;n đ&aacute;p ứng, đảm bảo trải nghiệm liền mạch tr&ecirc;n tất cả c&aacute;c thiết bị.<br><br> Hầu hết phần UI/UX của dự &aacute;n n&agrave;y kh&ocirc;ng phải của t&ocirc;i.

source: A package that elegantly animates number changes, creating a visually engaging transition from one value to another, perfect for counting or displaying real-time data updates.<br><br> Please note that the preview below may not appear as smooth as it does in reality. This is because I reduced the frame rate of the GIF to conserve storage space.
vi: Một g&oacute;i tạo hiệu ứng thay đổi số một c&aacute;ch trang nh&atilde;, tạo ra sự chuyển tiếp hấp dẫn về mặt trực quan từ gi&aacute; trị n&agrave;y sang gi&aacute; trị kh&aacute;c, ho&agrave;n hảo để đếm hoặc hiển thị c&aacute;c cập nhật dữ liệu theo thời gian thực.<br><br> Xin lưu &yacute; rằng bản xem trước b&ecirc;n dưới c&oacute; thể kh&ocirc;ng mượt m&agrave; như trong thực tế. Điều n&agrave;y l&agrave; do t&ocirc;i đ&atilde; giảm tốc độ khung h&igrave;nh của GIF để tiết kiệm dung lượng lưu trữ.

source: A package to implement hero animations, allowing users to click on images and smoothly zoom them into a larger, immersive view, enhancing the user experience and interaction with images.<br><br> Please note that the preview below may not appear as smooth as it does in reality. This is because I reduced the frame rate of the GIF to conserve storage space.
vi: G&oacute;i triển khai hoạt ảnh ch&iacute;nh, cho ph&eacute;p người d&ugrave;ng nhấp v&agrave;o h&igrave;nh ảnh v&agrave; ph&oacute;ng to ch&uacute;ng một c&aacute;ch mượt m&agrave; th&agrave;nh chế độ xem lớn hơn, sống động, n&acirc;ng cao trải nghiệm người d&ugrave;ng v&agrave; tương t&aacute;c với h&igrave;nh ảnh.<br><br> Xin lưu &yacute; rằng bản xem trước b&ecirc;n dưới c&oacute; thể kh&ocirc;ng mượt m&agrave; như trong thực tế. Điều n&agrave;y l&agrave; do t&ocirc;i đ&atilde; giảm tốc độ khung h&igrave;nh của GIF để tiết kiệm dung lượng lưu trữ.

source: A package for implementing CSS scroll animations on elements. These animations activate when an element enters the viewport during page scrolling. Users have the flexibility to configure the animations to trigger multiple times or just once. Additionally, the package offers pre-made animations as well as the option to create custom ones to suit various requirements.
vi: Gói này triển khai các hoạt ảnh cuộn CSS trên các phần tử. Những hoạt ảnh này kích hoạt khi một phần tử xuất hiện trong khi kéo trang. Người dùng có thể linh hoạt định cấu hình hoạt ảnh để kích hoạt nhiều lần hoặc chỉ một lần. Ngoài ra, gói này còn cung cấp các hình ảnh động được tạo sẵn cũng như tùy chọn tạo hình ảnh động tùy chỉnh để phù hợp với các yêu cầu khác nhau.

source: Call
vi: Gọi

source: Download
vi: Tải

source: Work with
vi: Làm việc với

source: This mini-game tests your brain to see how well you can concentrate on something without being distracted. The game always shows you an item with the title “Color” or “Meaning” and a colored text. Below that, you will always see six randomly generated buttons. Your goal is to press the correct button that matches the title and text. You have one minute to score as many points as possible with as few mistakes as possible. <br /><br /> For example, the title is “Color” and the text is “nine” with the color “red”. In this case, you should press the button below, which has a red color. In case the title is “Meaning”, you should press the button with the number “nine”.
vi: Trò chơi nhỏ này nhằm kiểm tra trí não của bạn để xem bạn có thể tập trung vào việc gì đó mà không bị phân tâm đến mức nào. Trò chơi luôn hiển thị cho bạn một mục có tiêu đề “Màu sắc” hoặc “Ý nghĩa” và văn bản màu. Bên dưới đó, bạn sẽ luôn thấy sáu nút được tạo ngẫu nhiên. Mục tiêu của bạn là nhấn đúng nút khớp với tiêu đề và văn bản. Bạn có một phút để ghi càng nhiều điểm càng tốt với càng ít lỗi càng tốt. <br /><br /> Ví dụ: tiêu đề là “Color” và văn bản là “nine” có màu “red”. Trong trường hợp này, bạn nên nhấn nút bên dưới, nút này có màu đỏ. Trường hợp tiêu đề là “Ý nghĩa” bạn nên nhấn vào nút có số “chín”.

source: Valid email address is required.
vi: địa chỉ email hợp lệ là bắt buộc.

source: <b>First Name</b>, <b>Last Name</b>, and <b>Message</b> as well as <b>E-Mail</b> are required.
vi: Bắt buộc phải có <b>Tên</b>, <b>Họ</b> và <b>Tin nhắn</b> cũng như <b>E-Mail</b>.

source: Too many attempts to send the form. Try again later.
vi: Quá nhiều yêu cầu! Vui lòng thử lại sau.

source: Your IP address has been blacklisted because you have sent an unusually high number of requests to the server! If these requests were not made maliciously, please contact me via
vi: Địa chỉ IP của bạn đã bị đưa vào danh sách đen vì bạn đã gửi số lượng yêu cầu cao bất thường đến máy chủ! Nếu những yêu cầu này không được thực hiện với mục đích xấu, vui lòng liên hệ với tôi qua

source: Next
vi: Tiếp theo

source: Alex Frei profile picture
vi: Ảnh đại diện của Alex Frei

source: View GitHub Profile
vi: Xem hồ sơ GitHub

source: View Facebook Profile
vi: Xem hồ sơ Facebook

source: View X Profile
vi: Xem hồ sơ X
